## OpenTofu Plan: platform/connectivity/hub/prod-gdpr

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.main.azurerm_management_lock.hub_vnet_rg["active"] will be created
  + resource "azurerm_management_lock" "hub_vnet_rg" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-hub-net-prod-weu-cannot-delete"
      + scope      = (known after apply)
    }

  # module.main.azurerm_management_lock.hub_vnet_rg["standby"] will be created
  + resource "azurerm_management_lock" "hub_vnet_rg" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-hub-net-prod-neu-cannot-delete"
      + scope      = (known after apply)
    }

  # module.main.azurerm_management_lock.netops_rg["active"] will be created
  + resource "azurerm_management_lock" "netops_rg" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-connectivity-netops-prod-weu-cannot-delete"
      + scope      = (known after apply)
    }

  # module.main.azurerm_management_lock.netops_rg["standby"] will be created
  + resource "azurerm_management_lock" "netops_rg" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-connectivity-netops-prod-neu-cannot-delete"
      + scope      = (known after apply)
    }

  # module.main.azurerm_network_watcher.nw["active"] will be created
  + resource "azurerm_network_watcher" "nw" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nw-connectivity-prod-weu"
      + resource_group_name = "rg-connectivity-netops-prod-weu"
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "network-monitoring"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "network-ops"
        }
    }

  # module.main.azurerm_network_watcher.nw["standby"] will be created
  + resource "azurerm_network_watcher" "nw" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nw-connectivity-prod-neu"
      + resource_group_name = "rg-connectivity-netops-prod-neu"
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "network-monitoring"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "network-ops"
        }
    }

  # module.main.azurerm_resource_group.hub_net["active"] will be created
  + resource "azurerm_resource_group" "hub_net" {
      + id         = (known after apply)
      + location   = "westeurope"
      + managed_by = "opentofu"
      + name       = "rg-hub-net-prod-weu"
      + tags       = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "hub-network"
        }
    }

  # module.main.azurerm_resource_group.hub_net["standby"] will be created
  + resource "azurerm_resource_group" "hub_net" {
      + id         = (known after apply)
      + location   = "northeurope"
      + managed_by = "opentofu"
      + name       = "rg-hub-net-prod-neu"
      + tags       = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "hub-network"
        }
    }

  # module.main.azurerm_resource_group.netops["active"] will be created
  + resource "azurerm_resource_group" "netops" {
      + id         = (known after apply)
      + location   = "westeurope"
      + managed_by = "opentofu"
      + name       = "rg-connectivity-netops-prod-weu"
      + tags       = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "network-ops"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "network-ops"
        }
    }

  # module.main.azurerm_resource_group.netops["standby"] will be created
  + resource "azurerm_resource_group" "netops" {
      + id         = (known after apply)
      + location   = "northeurope"
      + managed_by = "opentofu"
      + name       = "rg-connectivity-netops-prod-neu"
      + tags       = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "network-ops"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "network-ops"
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_group.subnet["snet-epa-connectors"] will be created
  + resource "azurerm_network_security_group" "subnet" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-hub-snet-epa-connectors-prod-weu-01"
      + resource_group_name = "rg-hub-net-prod-weu"
      + security_rule       = (known after apply)
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_group.subnet["snet-pep"] will be created
  + resource "azurerm_network_security_group" "subnet" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-hub-snet-pep-prod-weu-01"
      + resource_group_name = "rg-hub-net-prod-weu"
      + security_rule       = (known after apply)
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-epa-connectors_Inbound_allow-breakglass-mgmt"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow breakglass emergency SSH/RDP to EPA connector VMs"
      + destination_address_prefix  = "10.2.0.128/27"
      + destination_port_ranges     = [
          + "22",
          + "3389",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-breakglass-mgmt"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-weu-01"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefix       = "10.2.32.0/24"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-epa-connectors_Outbound_allow-entra-services"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow EPA connectors to reach Entra/Azure AD services"
      + destination_address_prefix  = "AzureActiveDirectory"
      + destination_port_ranges     = [
          + "443",
          + "80",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "allow-entra-services"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-weu-01"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefix       = "10.2.0.128/27"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-epa-connectors_Outbound_allow-to-firewall"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow all traffic to firewall for inspection/routing to internal apps"
      + destination_address_prefix  = "10.2.0.0/26"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "allow-to-firewall"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-weu-01"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefix       = "10.2.0.128/27"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-pep_Inbound_allow-breakglass-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow breakglass emergency access to private endpoints"
      + destination_address_prefix  = "10.2.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-breakglass-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-weu-01"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefix       = "10.2.32.0/24"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-pep_Inbound_allow-firewall-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow traffic from firewall to private endpoints (spoke traffic)"
      + destination_address_prefix  = "10.2.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-firewall-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-weu-01"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefix       = "10.2.0.0/26"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-pep_Inbound_deny-hub-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Deny"
      + description                 = "Deny hub subnets from bypassing firewall to reach PEP"
      + destination_address_prefix  = "10.2.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "deny-hub-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-weu-01"
      + priority                    = 4090
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-weu"
      + source_address_prefixes     = [
          + "10.2.0.112/28",
          + "10.2.0.128/27",
          + "10.2.0.64/27",
          + "10.2.0.96/28",
        ]
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_network_security_rule.rules["snet-pep_Outbound_allow-pep-responses"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                       = "Allow"
      + description                  = "Allow responses to firewall and breakglass"
      + destination_address_prefixes = [
          + "10.2.0.0/26",
          + "10.2.32.0/24",
        ]
      + destination_port_range       = "*"
      + direction                    = "Outbound"
      + id                           = (known after apply)
      + name                         = "allow-pep-responses"
      + network_security_group_name  = "nsg-hub-snet-pep-prod-weu-01"
      + priority                     = 100
      + protocol                     = "*"
      + resource_group_name          = "rg-hub-net-prod-weu"
      + source_address_prefix        = "10.2.0.160/27"
      + source_port_range            = "*"
    }

  # module.main.module.hub_vnet["active"].azurerm_route_table.route_table["force-firewall"] will be created
  + resource "azurerm_route_table" "route_table" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "rt-hub-force-firewall-prod-weu-01"
      + resource_group_name           = "rg-hub-net-prod-weu"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "default-to-firewall"
              + next_hop_in_ip_address = "10.2.0.4"
              + next_hop_type          = "VirtualAppliance"
            },
          + {
              + address_prefix         = "10.0.0.0/8"
              + name                   = "rfc1918-10-to-firewall"
              + next_hop_in_ip_address = "10.2.0.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.64/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["snet-dnspr-in"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.96/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dnspr-in"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"

      + delegation {
          + name = "dns-resolver-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["snet-dnspr-out"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.112/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dnspr-out"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"

      + delegation {
          + name = "dns-resolver-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["snet-epa-connectors"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.128/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-epa-connectors"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet.subnet["snet-pep"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.2.0.160/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-pep"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-weu"
      + virtual_network_name                          = "vnet-hub-prod-weu-01"
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet_network_security_group_association.subnet_nsg["snet-epa-connectors"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet_network_security_group_association.subnet_nsg["snet-pep"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.main.module.hub_vnet["active"].azurerm_subnet_route_table_association.subnet_rt["snet-epa-connectors"] will be created
  + resource "azurerm_subnet_route_table_association" "subnet_rt" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.main.module.hub_vnet["active"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.2.0.0/19",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "vnet-hub-prod-weu-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hub-net-prod-weu"
      + subnet                         = (known after apply)
      + tags                           = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "westeurope"
          + "region_role"   = "active"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_group.subnet["snet-epa-connectors"] will be created
  + resource "azurerm_network_security_group" "subnet" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-hub-snet-epa-connectors-prod-neu-01"
      + resource_group_name = "rg-hub-net-prod-neu"
      + security_rule       = (known after apply)
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_group.subnet["snet-pep"] will be created
  + resource "azurerm_network_security_group" "subnet" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-hub-snet-pep-prod-neu-01"
      + resource_group_name = "rg-hub-net-prod-neu"
      + security_rule       = (known after apply)
      + tags                = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-epa-connectors_Inbound_allow-breakglass-mgmt"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow breakglass emergency SSH/RDP to EPA connector VMs"
      + destination_address_prefix  = "10.3.0.128/27"
      + destination_port_ranges     = [
          + "22",
          + "3389",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-breakglass-mgmt"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-neu-01"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefix       = "10.3.32.0/24"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-epa-connectors_Outbound_allow-entra-services"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow EPA connectors to reach Entra/Azure AD services"
      + destination_address_prefix  = "AzureActiveDirectory"
      + destination_port_ranges     = [
          + "443",
          + "80",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "allow-entra-services"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-neu-01"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefix       = "10.3.0.128/27"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-epa-connectors_Outbound_allow-to-firewall"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow all traffic to firewall for inspection/routing to internal apps"
      + destination_address_prefix  = "10.3.0.0/26"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "allow-to-firewall"
      + network_security_group_name = "nsg-hub-snet-epa-connectors-prod-neu-01"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefix       = "10.3.0.128/27"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-pep_Inbound_allow-breakglass-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow breakglass emergency access to private endpoints"
      + destination_address_prefix  = "10.3.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-breakglass-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-neu-01"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefix       = "10.3.32.0/24"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-pep_Inbound_allow-firewall-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow traffic from firewall to private endpoints (spoke traffic)"
      + destination_address_prefix  = "10.3.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-firewall-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-neu-01"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefix       = "10.3.0.0/26"
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-pep_Inbound_deny-hub-to-pep"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Deny"
      + description                 = "Deny hub subnets from bypassing firewall to reach PEP"
      + destination_address_prefix  = "10.3.0.160/27"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "deny-hub-to-pep"
      + network_security_group_name = "nsg-hub-snet-pep-prod-neu-01"
      + priority                    = 4090
      + protocol                    = "*"
      + resource_group_name         = "rg-hub-net-prod-neu"
      + source_address_prefixes     = [
          + "10.3.0.112/28",
          + "10.3.0.128/27",
          + "10.3.0.64/27",
          + "10.3.0.96/28",
        ]
      + source_port_range           = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_network_security_rule.rules["snet-pep_Outbound_allow-pep-responses"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                       = "Allow"
      + description                  = "Allow responses to firewall and breakglass"
      + destination_address_prefixes = [
          + "10.3.0.0/26",
          + "10.3.32.0/24",
        ]
      + destination_port_range       = "*"
      + direction                    = "Outbound"
      + id                           = (known after apply)
      + name                         = "allow-pep-responses"
      + network_security_group_name  = "nsg-hub-snet-pep-prod-neu-01"
      + priority                     = 100
      + protocol                     = "*"
      + resource_group_name          = "rg-hub-net-prod-neu"
      + source_address_prefix        = "10.3.0.160/27"
      + source_port_range            = "*"
    }

  # module.main.module.hub_vnet["standby"].azurerm_route_table.route_table["force-firewall"] will be created
  + resource "azurerm_route_table" "route_table" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "rt-hub-force-firewall-prod-neu-01"
      + resource_group_name           = "rg-hub-net-prod-neu"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "default-to-firewall"
              + next_hop_in_ip_address = "10.3.0.4"
              + next_hop_type          = "VirtualAppliance"
            },
          + {
              + address_prefix         = "10.0.0.0/8"
              + name                   = "rfc1918-10-to-firewall"
              + next_hop_in_ip_address = "10.3.0.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "hub-network"
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.64/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["snet-dnspr-in"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.96/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dnspr-in"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"

      + delegation {
          + name = "dns-resolver-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["snet-dnspr-out"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.112/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dnspr-out"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"

      + delegation {
          + name = "dns-resolver-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["snet-epa-connectors"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.128/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-epa-connectors"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet.subnet["snet-pep"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.3.0.160/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-pep"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-net-prod-neu"
      + virtual_network_name                          = "vnet-hub-prod-neu-01"
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet_network_security_group_association.subnet_nsg["snet-epa-connectors"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet_network_security_group_association.subnet_nsg["snet-pep"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.main.module.hub_vnet["standby"].azurerm_subnet_route_table_association.subnet_rt["snet-epa-connectors"] will be created
  + resource "azurerm_subnet_route_table_association" "subnet_rt" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.main.module.hub_vnet["standby"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.3.0.0/19",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "northeurope"
      + name                           = "vnet-hub-prod-neu-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hub-net-prod-neu"
      + subnet                         = (known after apply)
      + tags                           = {
          + "costcenter"    = "cc-it-platform"
          + "data_boundary" = "gdpr"
          + "env"           = "prod"
          + "managed_by"    = "opentofu"
          + "org"           = "kneadcode"
          + "owner"         = "platform-engineering"
          + "portfolio"     = "coruscant"
          + "purpose"       = "hub-network"
          + "region"        = "northeurope"
          + "region_role"   = "standby"
          + "workload"      = "hub-network"
        }
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hub_firewall_private_ips = {
      + active  = "10.2.0.4"
      + standby = "10.3.0.4"
    }
  + hub_vnet_names           = {
      + active  = "vnet-hub-prod-weu-01"
      + standby = "vnet-hub-prod-neu-01"
    }
```
